{
  "100": {
    "Service State": "Service response Success\nRetry threshold exceeded",
    "Feed State": "Issues Possible",
    "Description of Condition": "Service is operational, but access Delays or interruptions may be encountered by user.",
    "Status": "Performance issues",
    "Comment": "Service and updates are operating but excessive load may effect some requests.",
    "Definition/Notes": "One of the benefits of HTTP’s well-defined protocol is that it allows failed requests to be retried, under certain circumstances. There are a couple phenomenon that are considered when a retry is initiated: A user initiates a retry, or an automatic retry.  We are only concerned with automatic retries.  An automatic retry occurs when an HTTP client implementation resends a previous request message without user intervention or initiation. This can happen when an HTTP request fails to return a complete response, or when a network connection drops before the request is sent.   If a retry is necessary to receive a complete response of the item's service additional retries are executed.  The default is set to 5.   If more than 5 retries occur for a particular service, the state of the service fails this test.  Note: 5 is the current default and can be updated in the config file for all the services, or individual services."
  },
  "101": {
    "Service State": "Service response Success\nResponse time exceeded average response times.\nRequires calculating",
    "Feed State": "Issues Possible",
    "Description of Condition": "Service is operational, but longer than normal Delays may be encountered by user.",
    "Status": "Performance issues",
    "Comment": "Service and updates are operating but excessive load may effect some requests.",
    "Definition/Notes": "The response time is the amount of time elapsed between sending the request to the service and the arrival of the response (as a time delta). The elapsed property specifically measures the time taken between sending the first byte of the request and finishing parsing the headers. It is therefore unaffected by consuming the response content.  The current default elapsed response threshold (in seconds) is set to 2 seconds.  It's worth noting, the elapsed time fluctuates dramatically throughout the day from a lower bound of around 0.3 seconds at times, to sometimes an upper bound of 3 seconds in the afternoon.  This parameter is configurable to a specific service, or all the services together."
  },
  "102": {
    "Service State": "Service response Success\nAGO or Item Fail",
    "Feed State": "No update issues",
    "Description of Condition": "Service Normal, but access to Online Item or environment may be an issue.",
    "Status": "Warning",
    "Comment": "Service and updates are operating but AGOL status is affecting access. https://status.arcgis.com/",
    "Definition/Notes": "Service running, AGOL is down"
  },
  "200": {
    "Service State": "Service response Success\nRetry logic detected \"Max requests exceeded\" throttle response\nSearch for \"Quota exceeded..",
    "Feed State": "Issues Possible",
    "Description of Condition": "Service is operational, but Org level Rate Limiting in effect!",
    "Status": "Performance issues",
    "Comment": "Service and updates are operating but rate limiting may effect some requests.",
    "Definition/Notes": ""
  },
  "201": {
    "Service State": "Service response Success\nLayer access Fail",
    "Feed State": "Issues Possible",
    "Description of Condition": "Layer Level access issues! Layer failed to add during Swap or service properties corrupted. User outage!",
    "Status": "Service disruption",
    "Comment": "Service and updates are down.",
    "Definition/Notes": "Service is acceptable, layer within is not"
  },
  "202": {
    "Service State": "Service response Success (owner)\nService response Fail (guest)",
    "Feed State": "No update issues (as owner)",
    "Description of Condition": "Service access issue. Likely to be an issue with Share Permissions. User outage!",
    "Status": "Service disruption",
    "Comment": "Service and updates are down.",
    "Definition/Notes": ""
  },
  "500": {
    "Service State": "Service response Fail\nAGO or Item Pass",
    "Feed State": "Error code 1 received. \nFeed failure",
    "Description of Condition": "Service is inaccessible! Feed update failed and Service checks failed, ignore Consecutive Failures Threshold, issue failure status. User outage!",
    "Status": "Service disruption",
    "Comment": "Service and updates are down.",
    "Definition/Notes": ""
  },
  "501": {
    "Service State": "Service response Fail\nItem response Fail\nAGO response Fail",
    "Feed State": "Error code 1 received. \nFeed failure",
    "Description of Condition": "Entire environment is down! User outage!",
    "Status": "Service disruption",
    "Comment": "Service and updates are down.",
    "Definition/Notes": ""
  },
  "000": {
    "Service State": "No access issues",
    "Feed State": "No update issues",
    "Description of Condition": "Operating Normally",
    "Status": "Normal",
    "Comment": "Service and updates are operating normally.",
    "Definition/Notes": ""
  },
  "001": {
    "Service State": "No access issues",
    "Feed State": "No update issues. \nYet elapsed time between now and lastUpdateTimestamp exceeds update interval (avgUpdateIntervalMins) by factor of X (TBD: assign config property) /  Secondary check on Feed routine",
    "Description of Condition": "Service Normal, but regular update has not been received. Service data could be stale! No new data available?",
    "Status": "Normal",
    "Comment": "Service and updates are operating normally.",
    "Definition/Notes": "Feed running but data is not being updated"
  },
  "002": {
    "Service State": "No access issues",
    "Feed State": "No update issues. \nYet elapsed time between now and last Run exceeds update interval (avgFeedIntervalMins) by factor of X (TBD)",
    "Description of Condition": "Service Normal, but status activity has not been received or updated. Service data could be stale! Has feed stopped running?",
    "Status": "Normal",
    "Comment": "Service and updates are operating normally.",
    "Definition/Notes": "Feed not running."
  },
  "003": {
    "Service State": "No access issues",
    "Feed State": "Error code 2 received:\nSource data download failure (error code > 1)",
    "Description of Condition": "Service Normal, but feed had issues downloading data from source. Service data could be stale! Do not report until Consecutive Failures Threshold is reached!",
    "Status": "Normal",
    "Comment": "Service is operating normally. Updates delayed due to data source.",
    "Definition/Notes": "Feed is running, but source data download has issues"
  },
  "004": {
    "Service State": "No access issues",
    "Feed State": "Error code 3 received:\nSource data processing failure (error code > 1)",
    "Description of Condition": "Service Normal, but feed had issues processing the source data. Service data could be stale! Do not report until Consecutive Failures Threshold is reached!",
    "Status": "Normal",
    "Comment": "Service is operating normally. Updates delayed due to data source.",
    "Definition/Notes": "Feed is running, but source data processing has issues"
  },
  "005": {
    "Service State": "No access issues",
    "Feed State": "Error code 1 received:\nGeneral feed / service update failure.",
    "Description of Condition": "Service Normal, but feed failed, possibly while updating service. Service data could be stale and overwrite could have issue! Do not report until Consecutive Failures Threshold is reached!",
    "Status": "Normal",
    "Comment": "Service is operating normally. Updates delayed due to data source.",
    "Definition/Notes": "Feed is running, but update processing has issues"
  },
  "006": {
    "Service State": "No access issues",
    "Feed State": "Status code -1 received. \nFeed has been placed in Maintenance mode.",
    "Description of Condition": "Service Normal, but the feed routine has been placed in a disabled state, ‘Enabled’ flag is False! This is manually set when we need to stop one or more feeds because of load issues or if we need to pause updates for Maintenance reasons.",
    "Status": "Under Maintenance",
    "Comment": "Service and updates stopped due to maintenance.",
    "Definition/Notes": "Feed is running, but has been disabled"
  },
  "007": {
    "Service State": "No access issues",
    "Feed State": "No update issues",
    "Description of Condition": "Service normal, but failed to access usage information",
    "Status": "Normal",
    "Comment": "Service and updates are operating normally.",
    "Definition/Notes": "Assume all values are never 0. This impacts trending accuracy"
  }
}